In [32]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.naive_bayes import GaussianNB

In [33]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [34]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [35]:
inputs = df.drop('Survived',axis='columns')
target = df.Survived
#delete cloumn

In [36]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)
#show mall famel

   female  male
0       0     1
1       1     0
2       1     0

In [37]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [38]:

inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)
#delete 1 column

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [39]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [41]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [42]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [43]:

X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [44]:

model = GaussianNB()

In [45]:
model.fit(X_train,y_train)

GaussianNB()

In [46]:
model.score(X_test,y_test)

0.7611940298507462

In [47]:
X_test[0:10]

     Pclass        Age      Fare  female
464       3  29.699118    8.0500       0
496       1  54.000000   78.2667       1
186       3  29.699118   15.5000       1
288       2  42.000000   13.0000       0
870       3  26.000000    7.8958       0
498       1  25.000000  151.5500       1
506       2  33.000000   26.0000       1
549       2   8.000000   36.7500       0
791       2  16.000000   26.0000       0
37        3  21.000000    8.0500       0

In [16]:
y_test[0:10]

687    0
859    0
492    0
801    1
590    0
166    1
477    0
882    0
273    0
632    1
Name: Survived, dtype: int64

In [29]:
model.predict(X_test[0:10])

array([0, 0, 0, 1, 0, 1, 0, 1, 0, 0], dtype=int64)